## Terraform Plan
```
cloudflare_dns_record.dns_records["sonarr.internal.chaldea.dev"]: Refreshing state... [id=8345b3a1776286929ffbd586a63a6be0]
cloudflare_dns_record.dns_records["profilarr.internal.chaldea.dev"]: Refreshing state... [id=2c582cf82648cce705ff8f62652a7f41]
cloudflare_dns_record.dns_records["chaldea.dev"]: Refreshing state... [id=aba288850d3fe7937374d7b46cd843a8]
cloudflare_dns_record.dns_records["papra.chaldea.dev"]: Refreshing state... [id=443725b2cb2add38bfb309bdecdbfb65]
cloudflare_dns_record.dns_records["dns.internal.chaldea.dev"]: Refreshing state... [id=7d5ed45095f1b57e61f374c2eca964c4]
cloudflare_dns_record.dns_records["prowlarr.internal.chaldea.dev"]: Refreshing state... [id=e47d7e11229fecdeed1cb96e0c88c927]
cloudflare_dns_record.dns_records["sabnzbd.internal.chaldea.dev"]: Refreshing state... [id=702ca7d78e11ab8a9129b988e1afa65e]
cloudflare_dns_record.dns_records["pdf.chaldea.dev"]: Refreshing state... [id=336bd5267e5f41581eebd26e6f7546ab]
cloudflare_dns_record.dns_records["pangolin.chaldea.dev"]: Refreshing state... [id=86b079cb6e189df0b7359fa9ad7cf1dd]
cloudflare_dns_record.dns_records["jellyseerr.chaldea.dev"]: Refreshing state... [id=ceeee7642c879d869960ca0f8e55e22f]
cloudflare_dns_record.dns_records["music.chaldea.dev"]: Refreshing state... [id=c83f24c220f7ae9f919b5e695f325b9d]
cloudflare_dns_record.dns_records["radarr.internal.chaldea.dev"]: Refreshing state... [id=25315a1e5b5540d3d942809d5b082c65]
cloudflare_dns_record.dns_records["ntfy.chaldea.dev"]: Refreshing state... [id=36ef2827708209c0cc43c7c942c6cdb1]
cloudflare_dns_record.dns_records["jellyfin.chaldea.dev"]: Refreshing state... [id=307442fd269f85099852ab1b29eac680]
cloudflare_dns_record.dns_records["vaultwarden.chaldea.dev"]: Refreshing state... [id=a03c347ea478ebccb1cd756ef172f39d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_dns_record.dns_records["ntfy.chaldea.dev"] will be destroyed
  # (because key ["ntfy.chaldea.dev"] is not in for_each map)
  - resource "cloudflare_dns_record" "dns_records" {
      - content     = "chaldea.dev" -> null
      - created_on  = "2026-02-08T21:18:02Z" -> null
      - id          = "36ef2827708209c0cc43c7c942c6cdb1" -> null
      - meta        = jsonencode({})
      - modified_on = "2026-02-08T21:18:02Z" -> null
      - name        = "ntfy.chaldea.dev" -> null
      - proxiable   = true -> null
      - proxied     = false -> null
      - settings    = {
          - flatten_cname = false -> null
        } -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "CNAME" -> null
      - zone_id     = "763f4223335c61f44d73e6955211152a" -> null
    }

  # cloudflare_dns_record.dns_records["push.chaldea.dev"] will be created
  + resource "cloudflare_dns_record" "dns_records" {
      + comment_modified_on = (known after apply)
      + content             = "chaldea.dev"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "push.chaldea.dev"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "763f4223335c61f44d73e6955211152a"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```